#+TITLE: Lowest eigenvalue with Variational Quantum Eigensolver
#+AUTHOR: Soham Pal
#+OPTIONS: html-postamble:nil html-scripts:nil html-doctype:html5 num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/worg.css" />
#+PROPERTY: header-args :tangle main.py :jupyter-python :session py :kernel .qiskit-venv :async yes :exports both

#+begin_src jupyter-python :results silent :exports none
%load_ext autoreload
%autoreload 2
#+end_src

* Introduction

Variational quantum eigensolver (VQE)[fn:1] is a hybrid quantum-classical
algorithm that can be used on NISQ devices to find the ground states of various
quantum mechanical systems, most notably used in quantum chemistry[fn:2] and
nuclear physics[fn:3]. Here we will see a demonstration of the variational
quantum eigensolver with the Hamiltonian
\begin{align}
H = \begin{bmatrix}
  1 & 0 & 0 & 0\\
  0 & 0 & -1 & 0\\
  0 & -1 & 0 & 0\\
  0 & 0 & 0 & 1
  \end{bmatrix},
\end{align}
whose eigenvalues can be calculated easily on a classical computer:

#+begin_src jupyter-python
import numpy as np

H = np.zeros(shape=(4, 4))
H[0, 0] = H[3, 3] = 1
H[1, 2] = H[2, 1] = -1

print("Hamiltonian:")
print(H)

print(f"Eigenvalues: {np.linalg.eigvals(H)}")
#+end_src

#+RESULTS:
: Hamiltonian:
: [[ 1.  0.  0.  0.]
:  [ 0.  0. -1.  0.]
:  [ 0. -1.  0.  0.]
:  [ 0.  0.  0.  1.]]
: Eigenvalues: [ 1. -1.  1.  1.]

The minimum eigenvalue is \(-1\). While the eigenvalues for this Hamiltonian could
be calculated easily on a classical computer, this is not generally true for
Hamiltonians of interest in physics and chemistry. Hence the need for algorithms
like VQE.

* Pauli Decomposition

One caveat of using VQE is that in general it is not easy to calculate the
expectation value of the Hamiltonian. However if the Hamiltonian can be
expressed as a linear sum of tensor products of the Pauli matrices \((I, X, Y,
Z)\), then we can easily calculate the expectation value of the
Hamiltonian. Tensor products of Pauli matrices, \(\{\{I, X, Y, Z\}^{⊗n}\}\),
form an orthogonal basis for the vector space of \(2^n × 2^n\) Hermitian
matrices. Thus any \(2^n × 2^n\) Hermitian matrix can be expressed as a linear
sum of tensor products of Pauli matrices. For example, for n = 1, consider the
Hermitian matrix
\begin{align}
A = \begin{bmatrix} 2 & 1 \\ 1 & -3 \end{bmatrix}.
\end{align}
This matrix can be expressed as \(A = -\tfrac{1}{2}I + X + \tfrac{5}{2}Z\). In
general for a \(2^n × 2^n\) Hermitian matrix A, the coefficients of expansion in
the basis of tensor products of Pauli matrices is given by
\begin{align}
a_{i_1 i_2 ⋯ i_n}
= \frac{1}{2^n} \mathrm{tr}((σ_{i_1} ⊗ σ_{i_2} ⊗ ⋯ σ_{i_n})A),
\end{align}
where \(σ_{i_j} ∈ \{I, X, Y, Z\}\). The factor of \(\frac{1}{2^n}\) is to normalize
the Pauli matrices. The function =pauli_decomposition= in
=vqe/utils.py= does this decomposition for any \(2^n × 2^n\) Hermitian
matrix. Here is the decomposition of our Hamiltonian \(H\):

#+begin_src jupyter-python
from vqe.utils import pauli_decomposition

pauli_decomposition(H)
#+end_src

#+RESULTS:
: defaultdict(int, {'II': 0.5, 'XX': -0.5, 'YY': -0.5, 'ZZ': 0.5})

We can express our Hamiltonian as \(H = \tfrac{1}{2}(II + ZZ - XX - YY)\). Thus
\(〈H〉 = \tfrac{1}{2}(〈II〉 + 〈ZZ〉 - 〈XX〉 - 〈YY〉)\), where \(〈O〉 =
〈ψ|O|ψ〉\) is the expectation value of the observable \(O\). Since the
expectation value of \(II\) is always \(1\), therefore this boils down to
calculating the expectation values of \(ZZ\), \(XX\), and \(YY\), and then doing
the weighted sum of all the four expectation values. Tensor products of Pauli
matrices have only two eigenvalues, \(±1\). The expectation value of a tensor
product of Pauli matrices can be calculated on a quantum computer as
\(\tfrac{(N_+ - N_-)}{N}\), where \(N_±\) is the number of measured eigenvectors
corresponding to the eigenvalue \(±1\) and \(N\) is the total number of
measurements[fn:4]. The function =energy= in =vqe/vqe.py= computes the
expectation value of any Hamiltonian which has a Pauli decomposition with
respect to any given ansatz.

* Simulation

We will do these simulations with the =qasm_simulator= backend provided by
Qiskit, initially without noise. First we will demonstrate VQE with the single
layer RYRZ ansatz, and then with the single layer RX ansatz.

#+begin_src jupyter-python
from vqe.vqe import energy
from vqe.optimizers import SPSA


# The expectation value of the Hamiltonian
def parameterized_energy(params, H, ansatz, **kwargs):
    return energy(H, ansatz, params=params, **kwargs)


# Random number generator
seed = 42
rng = np.random.default_rng(seed)

# Optimizer
maxiter = 1000
save_steps = 50
a = 2 * np.pi * 0.1
c = 0.1
A = 0.0001
spsa = SPSA(a=a, c=c, A=A)

# VQE with RYRZ ansatz
reps = 1
thetas_yz = rng.uniform(0, 2 * np.pi, size=(4 * (reps + 1)))
ryrz_ansatz = RYRZAnsatz(reps=reps)

result_yz = spsa.minimize(
    parameterized_energy,
    thetas_yz,
    maxiter=maxiter,
    save_steps=save_steps,
    seed=seed,
    H=H,
    ansatz=ryrz_ansatz,
)

print(f"Lowest eigenvalue is {result_yz['fun']:.4f}.")
#+end_src

#+RESULTS:
: Lowest eigenvalue is -0.9990.

#+begin_src jupyter-python
# VQE with RX ansatz
reps = 1
thetas_x = rng.uniform(0, 2 * np.pi, size=reps)
rx_ansatz = RXAnsatz(reps=reps)

result_x = spsa.minimize(
    parameterized_energy,
    thetas_x,
    maxiter=maxiter,
    save_steps=save_steps,
    seed=seed,
    H=H,
    ansatz=rx_ansatz,
)

print(f"Lowest eigenvalue is {result_x['fun']:.4f}.")
#+end_src

#+RESULTS:
: Lowest eigenvalue is -1.0000.

Both the ansatzes effectively give \(-1\) as the minimum eigenvalue when running
on the simulator without noise. Let us now add noise to the simulation. For this
we will real noise data from the =ibmq_vigo= device using the data stored in
Qiskit Terra.

#+begin_src jupyter-python
from qiskit import Aer
from qiskit.test.mock import FakeVigo
from qiskit.providers.aer.noise import NoiseModel

# Vigo noise model
device_backend = FakeVigo()
coupling_map = device_backend.configuration().coupling_map
noise_model = NoiseModel.from_backend(device_backend)
basis_gates = noise_model.basis_gates

# BasicAer does not support noise, we need the simulator from Aer
backend = Aer.get_backend("qasm_simulator")

# Noisy VQE with RYRZ ansatz
result_yz_noisy = spsa.minimize(
    parameterized_energy,
    thetas_yz,
    maxiter=maxiter,
    save_steps=save_steps,
    seed=seed,
    H=H,
    ansatz=ryrz_ansatz,
    backend=backend,
    noise_model=noise_model,
    coupling_map=coupling_map,
    basis_gates=basis_gates
)

print(f"Lowest eigenvalue is {result_yz_noisy['fun']:.4f}.")
#+end_src

#+RESULTS:
: Lowest eigenvalue is -0.8760.

#+begin_src jupyter-python
# Noisy VQE with RX ansatz
result_x_noisy = spsa.minimize(
    parameterized_energy,
    thetas_x,
    maxiter=maxiter,
    save_steps=save_steps,
    seed=seed,
    H=H,
    ansatz=rx_ansatz,
    backend=backend,
    noise_model=noise_model,
    coupling_map=coupling_map,
    basis_gates=basis_gates
)

print(f"Lowest eigenvalue is {result_x_noisy['fun']:.4f}.")
#+end_src

#+RESULTS:
: Lowest eigenvalue is -0.8584.

With noise added to the system we no longer get the exact lowest eigenvalue of
the Hamiltonian. But we still come close to it.

